In [3]:
import pandas as pd

In [88]:
df_data = pd.read_csv("datasets/data.csv")

In [89]:
df_data.head(2)

     Name  Duration  Pulse  Maxpulse  Calories
0  Robert        60    110       130     409.1
1    Mark        60    117       145     479.0

In [32]:
df_data2 = pd.read_csv("datasets/data2.csv")

In [33]:
df_data2.head(2)

     Name  Week  Duration  Pulse  Maxpulse  Calories
0  Robert     1        60    110       130     409.1
1    Mark     1        60    117       145     479.0

In [38]:
df_1 = df_data.groupby(by="Name").sum()
df_1.head()

         Duration  Pulse  Maxpulse  Calories
Name
Charles       710    988      1277    4016.5
Clark         995   1704      2113    5416.2
Dante         430    814       997    2704.4
James         435    747       948    2589.5
Jobs         1260   1885      2333    7637.0

In [39]:
df_1.columns

Index(['Duration', 'Pulse', 'Maxpulse', 'Calories'], dtype='object')

In [40]:
df_1.index
df_1["Name"] = df_1.index

In [41]:
df_1.head(2)

         Duration  Pulse  Maxpulse  Calories     Name
Name
Charles       710    988      1277    4016.5  Charles
Clark         995   1704      2113    5416.2    Clark

In [42]:
colunas = ['Name', 'Duration', 'Pulse', 'Maxpulse', 'Calories']

df_1 = df_1[colunas]

In [43]:
df_1.head(2)

            Name  Duration  Pulse  Maxpulse  Calories
Name
Charles  Charles       710    988      1277    4016.5
Clark      Clark       995   1704      2113    5416.2

In [46]:
# df_1.reset_index()
df_1.index = range(len(df_1))

In [20]:
# df_1.rename(columns=['Nome', 'Duration', 'Pulse', 'Maxpulse', 'Calories'])

In [48]:
df_1.head()

      Name  Duration  Pulse  Maxpulse  Calories
0  Charles       710    988      1277    4016.5
1    Clark       995   1704      2113    5416.2
2    Dante       430    814       997    2704.4
3    James       435    747       948    2589.5
4     Jobs      1260   1885      2333    7637.0

In [49]:
## APPLY

In [50]:
df_data.head(2)

     Name  Duration  Pulse  Maxpulse  Calories
0  Robert        60    110       130     409.1
1    Mark        60    117       145     479.0

#### meta do exercicios duracao de 60 (sim | nao)

In [55]:
# df_data[df_data.Duration < 60]

In [60]:
# import numpy as np
# df_data["Meta"] = np.nan

In [83]:
def verifica_duracao(x):
    if x >= 60:
        return "Sim"
    else:
        return "Nao"

In [84]:
df_data["Meta"] = df_data.Duration.apply(verifica_duracao)#axis=1

In [91]:
df_data["Meta"] = df_data.Duration.apply(
    lambda x: "sim" if x >= 60 else "Nao"
)#axis=1

In [93]:
df_data.head(2)

     Name  Duration  Pulse  Maxpulse  Calories Meta
0  Robert        60    110       130     409.1  sim
1    Mark        60    117       145     479.0  sim

In [113]:
def analise_meta(linha):
    if linha.Meta == "sim" and linha.Pulse < 110:
        return "Foi Facil"
    elif linha.Meta == "sim":
        return "Foi dificil"
    else:
        return "Fraco"

In [114]:
df_data["metaVSpulse"] = df_data.apply(analise_meta, axis=1)

In [115]:
df_data.head(20)

        Name  Duration  Pulse  Maxpulse  Calories Meta  metaVSpulse
0     Robert        60    110       130     409.1  sim  Foi dificil
1       Mark        60    117       145     479.0  sim  Foi dificil
2      Susan        60    103       135     340.0  sim    Foi Facil
3      Peter        45    109       175     282.4  Nao        Fraco
4      Dante        45    117       148     406.0  Nao        Fraco
5   Samantha        60    102       127     300.0  sim    Foi Facil
6     Leonel        60    110       136     374.0  sim  Foi dificil
7       Jobs        45    104       134     253.3  Nao        Fraco
8      Clark        30    109       133     195.1  Nao        Fraco
9     Louise        60     98       124     269.0  sim    Foi Facil
10   Charles        60    103       147     329.3  sim    Foi Facil
11     Megan        60    100       120     250.7  sim    Foi Facil
12     James        60    106       128     345.3  sim    Foi Facil
13  Nicholas        60    104       132     379.3  sim    Foi Facil
14    Robert        60     98       123     275.0  sim    Foi Facil
15     Clark        60     98       120     215.2  sim    Foi Facil
16    Leonel        60    100       120     300.0  sim    Foi Facil
17     Megan        45     90       112       NaN  Nao        Fraco
18     Susan        60    103       123     323.0  sim    Foi Facil
19     Clark        45     97       125     243.0  Nao        Fraco